{"type":"data","nodes":[{"type":"data","data":[{"about":1,"projects":2},"I'm **Bengü**, a graphic designer, living in Istanbul.\n\nI'm a junior graphic designer with a passion for creating beautiful and functional designs. I find particular fascination in typography, designing logos, wallpapers and posters. I'm always looking for new challenges and opportunities to learn and grow as a designer.\n\nSend me emails to: [bengubastug@gmail.com](mailto:bengubastug@gmail.com)\n",[3,22,35,40,45,50,64],{"title":4,"thumb":5,"content":6,"photos":7},"Logo Design for the Brand \"Island Citrus\"","/projects/Island Citrus.png","For the Island Citrus Gin brand identity, I crafted a distinctive typeface logo by modifying a clean font to feature wavy lines, reflecting the brand's tropical and refreshing essence. To enhance visual interest and convey the brand's vibrant spirit, I selected a dynamic color palette inspired by tropical elements. \n\nThe logo's color changes dynamically across four vibrant hues, a vibrant blue background represents the clean, refreshing ocean, while a vibrant red symbolizes the striking beauty of coral reefs. A soft pink background paired with vibrant blue font evokes the freshness of summery fruits. Additionally, a lush green background with vibrant yellow font brings to mind tropical forests and the warmth of the summer sun. \n\nFinally, a vibrant yellow background with a navy-purple font suggests the rich variety of tropical fruits. The packaging design incorporates a recurring brand logo inside a round shape reminiscent of a stamp, reinforcing the brand's exotic and premium feel. This cohesive visual language is designed to stand out in the competitive gin market, appealing to both connoisseurs and casual drinkers seeking a unique and luxurious experience.\n",[5,8,9,10,11,12,13,14,15,16,17,18,19,20,21],"/projects/Mockup-Island Citrus-V2.png","/projects/Artboard 4.png","/projects/Artboard 5.png","/projects/Artboard 6.png","/projects/Artboard 7.png","/projects/Artboard 9.png","/projects/Artboard 10.png","/projects/Artboard 11.png","/projects/Artboard 12.png","/projects/Artboard 13.png","/projects/Artboard 14.png","/projects/Artboard 15.png","/projects/Asset 1.png","/projects/Moodboard.png",{"title":23,"thumb":24,"content":25,"photos":26},"Logo Design for the Brand \"Flipped\"","/projects/flipped (2).png","For the pancake company \"Flipped,\" which caters to young, hip customers, I developed a distinctive and playful brand identity. The typeface logo was crafted with a luxurious font, where select letters were given a bubbly, pancake-like appearance. \n\nThis subtle transformation adds a whimsical touch while maintaining an upscale feel. Within the font, I incorporated shapes that resemble melting dough, enhancing the playful vibe and making the design more engaging. These dough-melting shapes also serve as standalone logos for various packaging, creating a cohesive and versatile brand image. \n\nThe color palette was thoughtfully chosen to reflect the delightful flavors and experiences associated with pancakes, a pink background with purple font evokes the sweetness of blueberry and strawberry toppings, a mint background with light brown font hints at the freshness of cooked dough, and a light brown background with mint font offers a nod to classic, comforting pancake hues. This vibrant and innovative design not only captures the fun and modern essence of \"Flipped\" but also appeals to the trendy, youthful audience, making the brand both memorable and appealing.\n",[24,27,28,29,30,31,32,33,34],"/projects/flipped (8).png","/projects/flipped (11).png","/projects/flipped (3).png","/projects/flipped (9).png","/projects/flipped (12).png","/projects/flipped (4).png","/projects/flipped (6).png","/projects/flipped (5).png",{"title":36,"thumb":37,"content":38,"photos":39},"Logo Design for the Brand \"Sabroso\"","/projects/Sabroso.png","I designed a typeface logo for \"Sabroso,\" a Mexican restaurant whose name means \"tasty\" or \"flavorful\" in Spanish, perfectly capturing the essence of its authentic and delicious cuisine. \n\nThe logo features a vibrant yellow background, symbolizing warmth and energy, with a striking red font color that conveys passion and excitement. The letters are outlined with a lush green stroke, providing a vintage feel and invoking nostalgia. \n\nTo further emphasize the fiery and spicy nature of the food, some letters are modified to be more pointy. Beneath the typeface, a ribbon-like figure with sharp edges adds to the vintage aesthetic and reinforces the theme of hot, bold flavors. This design skillfully combines vibrant colors and vintage elements to create a visually appealing and representative logo for the restaurant.\n",[37],{"title":41,"thumb":42,"content":43,"photos":44},"Logo Design for the Brand \"Bloomora\"","/projects/Logo Design.png","Introducing \"Bloomora,\" a brand synonymous with tranquility and rejuvenation, specializing in spa, beauty, and wellness products. The logo features a sleek letter \"b\" design, subtly shadowed against a serene light blue backdrop, exuding a sense of depth and serenity. \n\nIts light purple hue infuses sophistication and creativity, inviting customers to embark on a journey of self-care and personal growth. The shadows within the letter symbolize the multi-faceted nature of the brand's offerings, promising a holistic experience that nurtures both body and soul. \n\n\"Bloomora\" epitomizes a harmonious blend of elegance, innovation, and tranquility, offering a range of products designed to enhance well-being and inspire inner beauty.\n",[42],{"title":46,"thumb":47,"content":48,"photos":49},"Package Design for the Brand \"Holobite\"","/projects/Holobite.png","The package design for the chocolate brand \"Holobite\" incorporates a hologram background with soft colors and wavy patterns, targeting a young demographic drawn to trending holographic designs. \n\nIn the labeling, a simple ready-made font is utilized on a small white label, ensuring the focus remains on the striking holographic background. This design approach, showcased through a mockup, emphasizes the modern and captivating aesthetic of the package.\n",[47],{"title":51,"thumb":52,"content":53,"photos":54},"Wallpapers","/projects/Fluid Color.png","Explore a collection of wallpaper designs I've crafted using Adobe Illustrator, showcasing my flair for digital design. From lively patterns bursting with color to 3D design, these wallpapers reflect my diverse creative palette.\n",[52,55,56,57,58,59,60,61,62,63],"/projects/Wave.png","/projects/Blend -V2.png","/projects/Abstract Background.png","/projects/LetterBackground1.png","/projects/LetterBackground2.png","/projects/LetterBackground3.png","/projects/Liquid Holographic.png","/projects/Hologram Background.png","/projects/Inflated Rainbow.png",{"title":65,"thumb":66,"content":67,"columns":68,"photos":69},"Drafts","/projects/Goat.png","A collection of diverse design exercises that showcase my creative process and experimentation. From quick sketches to spontaneous digital compositions, these exercises serve as a playground for exploring new techniques.\n",2,[66,70,71,72,73,74,75,76,77,78,79,80,81],"/projects/Triangle.png","/projects/Apple Illustration.png","/projects/Button.png","/projects/letter b.png","/projects/Owl.png","/projects/Text in shape.png","/projects/Spoon Collection.png","/projects/Blend -V1.png","/projects/Whale.png","/projects/Heart3D.png","/projects/Celtic Knots.png","/projects/Paper Cutout.png"],"uses":{}},{"type":"data","data":[{"title":1,"thumb":2,"content":3,"photos":4},"Package Design for the Brand \"Holobite\"","/projects/Holobite.png","The package design for the chocolate brand \"Holobite\" incorporates a hologram background with soft colors and wavy patterns, targeting a young demographic drawn to trending holographic designs. \n\nIn the labeling, a simple ready-made font is utilized on a small white label, ensuring the focus remains on the striking holographic background. This design approach, showcased through a mockup, emphasizes the modern and captivating aesthetic of the package.\n",[2]],"uses":{"params":["slug"]}}]}
